renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_qspi_smstr_rx/src/r_qspi_smstr.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015-2019) Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* System Name  : QSPI single master driver
* File Name    : r_qspi_smstr.c
* Version      : 1.12
* Device       : RX
* Abstract     : Main processing source file for QSPI single master driver
* Tool-Chain   : Renesas RXC Toolchain v3.01.00
* OS           : not use
* H/W Platform : not use
* Description  : Functions for QSPI single master driver
* Limitation   : none
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 24.06.2014 1.05     First Release
*              : 29.08.2014 1.06     Added the pointer check for transmission data buffer
*              :                     and reception data buffer.
*              :                     Added demo source for DTC in this driver.
*              : 28.11.2014 1.07     Changed r_qspi_smstr_single_writeread_dmacdtc(), 
*              :                     r_qspi_smstr_dualquad_write_dmacdtc() and
*              :                     r_qspi_smstr_dualquad_read_dmacdtc().
*              : 30.01.2015 1.08     Added RX71M.
*              : 31.07.2017 2.08     Supported RX65N-2MB.
*              :                     Fixed to correspond to Renesas coding rule.
*              : 04.04.2019 1.12     Added support for GNUC and ICCRX.
*              :                     Fixed coding style. 
*******************************************************************************/

/*******************************************************************************
Includes <System Includes> , "Project Includes"
*******************************************************************************/
/* Public interface header file for this package */
#include "r_qspi_smstr_rx_if.h"
/* Configuration for this package. */
#include "r_qspi_smstr_rx_config.h"
/* Private header file for this package. */
#include "./src/r_qspi_smstr_private.h"

#ifdef QSPI_SMSTR_CFG_LONGQ_ENABLE
/* Uses LONGQ driver header file */
#include "r_longq_if.h"
#endif /* QSPI_SMSTR_CFG_LONGQ_ENABLE */


/*******************************************************************************
Macro definitions
*******************************************************************************/


/*******************************************************************************
Typedef definitions
*******************************************************************************/


/*******************************************************************************
Private variables and functions
*******************************************************************************/
#ifdef QSPI_SMSTR_CFG_LONGQ_ENABLE
static longq_hdl_t       p_qspi_smstr_long_que;       /* LONGQ handler */
#endif  /* QSPI_SMSTR_CFG_LONGQ_ENABLE */


/*******************************************************************************
* Function Name: R_QSPI_SMstr_Open
* Description  : Initializes setting of ports.
*                Initializes the QSPI registers for QSPI control.
* Arguments    : channel -
*                    Which channel to use
*                spbr_data -
*                    Setting of QSPI Bit Rate Register (SPBR)
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*                QSPI_SMSTR_ERR_OTHER -
*                    QSPI resource has been acquired by other task already.
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Open(uint8_t channel, uint8_t spbr_data)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
#ifdef QSPI_SMSTR_CFG_USE_FIT
    bool              retbool = false;
#endif  /* QSPI_SMSTR_CFG_USE_FIT */
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    /* ---- QSPI hardware lock ---- */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    retbool = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_QSPI + channel));
    if (false == retbool)
    {
        /* Lock has already been acquired by other task. Needs to try again later. */
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_OTHER;
    }
#endif  /* QSPI_SMSTR_CFG_USE_FIT */
    
    /* Initialize the ports. */
    r_qspi_smstr_io_init(channel);
    
    /* Initialize the QSPI registers for QSPI control. */
    r_qspi_smstr_enable(channel, spbr_data);
    
