renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_qspi_smstr_rx/src/r_qspi_smstr.c
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: R_QSPI_SMstr_Close
* Description  : Stops QSPI and puts it in module stop to conserve power.
*                Resets setting of ports..
* Arguments    : channel -
*                    Which channel to use
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Close(uint8_t channel)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    /* Set module stop of QSPI. */
    r_qspi_smstr_disable(channel);
    
    /* Reset setting of ports. */
    r_qspi_smstr_io_reset(channel);
    
    /* QSPI hardware unlock */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_QSPI + channel));
#endif  /* QSPI_SMSTR_CFG_USE_FIT */
    
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: R_QSPI_SMstr_Control
* Description  : Changes setting of SPI clock mode and bit rate of QSPI.
* Arguments    : channel -
*                    Which channel to use
*                clk_mode -
*                    Number of SPI clock mode
*                        0: CPOL=0, CPHA=0
*                        1: CPOL=0, CPHA=1
*                        2: CPOL=1, CPHA=0
*                        3: CPOL=1, CPHA=1
*                spbr_data -
*                    Setting of QSPI Bit Rate Register (SPBR)
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Control(uint8_t channel, uint8_t clk_mode, uint8_t spbr_data)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    if (3 < clk_mode)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }
    
    /* Change SPI clock mode and bit rate of QSPI. */
    r_qspi_smstr_change(channel, clk_mode, spbr_data);
    
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: R_QSPI_SMstr_Write
* Description  : Executes transmission operation.
*                When using DMAC or DTC, supports that the number of data is a multiple of 16.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*------------------------------------------------------------------------------
* Note         : Set the "p_qspi_smstr_info->data_cnt" to a multiple of 16 using DMAC or DTC.
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Write(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->data_cnt)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->p_tx_data)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_SINGLE_SPI_READ      == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_DMAC == p_qspi_smstr_info->tran_mode) ||
        (QSPI_SMSTR_DTC  == p_qspi_smstr_info->tran_mode))
    {
        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4-byte unit. */
        if (0 != ((uint32_t)p_qspi_smstr_info->p_tx_data & 0x00000003u))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }

        /* ---- Check the counter (16-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 16 using DMAC or DTC. */
        if (0 != (p_qspi_smstr_info->data_cnt & 0x0000000fu))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }
    }

    switch (p_qspi_smstr_info->tran_mode)
    {
        case QSPI_SMSTR_SW:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_WRITE:
                    ret = r_qspi_smstr_single_writeread_software(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_write_software(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        case QSPI_SMSTR_DMAC:
        case QSPI_SMSTR_DTC:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_WRITE:
                    ret = r_qspi_smstr_single_writeread_dmacdtc(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_write_dmacdtc(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        default:
            ret = QSPI_SMSTR_ERR_PARAM;
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        break;
    }

    return ret;
}


