renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_qspi_smstr_rx/src/r_qspi_smstr.c
/*******************************************************************************
* Function Name: R_QSPI_SMstr_Read
* Description  : Executes reception operation.
*                When using DMAC or DTC, supports that the number of data is a multiple of 16.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*------------------------------------------------------------------------------
* Note         : Set the "p_qspi_smstr_info->data_cnt" to a multiple of 16 using DMAC or DTC.
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Read(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->data_cnt)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_qspi_smstr_info->p_rx_data)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_SINGLE_SPI_WRITE     == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if ((QSPI_SMSTR_DMAC == p_qspi_smstr_info->tran_mode) ||
        (QSPI_SMSTR_DTC  == p_qspi_smstr_info->tran_mode))
    {
        /* ---- Check the buffer boundary (4-byte unit). ---- */
        /* Cast the variable to a uint32_t type because the address of this pointer may not be 4 bytes unit. */
        if (0 != ((uint32_t)p_qspi_smstr_info->p_rx_data & 0x00000003u))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }

        /* ---- Check the counter (16-byte unit). ---- */
        /* NOTE: Do not support the number of data other than a multiple of 16 using DMAC or DTC. */
        if (0 != (p_qspi_smstr_info->data_cnt & 0x0000000fu))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return QSPI_SMSTR_ERR_PARAM;
        }
    }

    switch (p_qspi_smstr_info->tran_mode)
    {
        case QSPI_SMSTR_SW:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_READ:
                    ret = r_qspi_smstr_single_writeread_software(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_read_software(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        case QSPI_SMSTR_DMAC:
        case QSPI_SMSTR_DTC:
            switch (p_qspi_smstr_info->op_mode)
            {
                case QSPI_SMSTR_SINGLE_SPI_READ:
                    ret = r_qspi_smstr_single_writeread_dmacdtc(channel, p_qspi_smstr_info);
                break;
                case QSPI_SMSTR_DUAL_SPI:
                case QSPI_SMSTR_QUAD_SPI:
                    ret = r_qspi_smstr_dualquad_read_dmacdtc(channel, p_qspi_smstr_info);
                break;
                default:
                    ret = QSPI_SMSTR_ERR_PARAM;
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                break;
            }
        break;
        default:
            ret = QSPI_SMSTR_ERR_PARAM;
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        break;
    }

    return ret;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_single_writeread_software
* Description  : Transmits data, receives data and stores to the specified buffer in single mode using software.
* Arguments    : channel -
*                    Which channel to use
*                * p_qspi_smstr_info -
*                    QSPI information
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_single_writeread_software(uint8_t channel, qspi_smstr_info_t * p_qspi_smstr_info)
{
    qspi_smstr_status_t   ret = QSPI_SMSTR_SUCCESS;
    uint32_t            trx_wait;
    uint32_t            trx_cnt;
    uint32_t            cnt;
    uint32_t            tx_data[4];
    uint32_t            rx_data[4];
    uint8_t           * p_tx_data;
    uint8_t           * p_rx_data;
    volatile uint8_t R_BSP_EVENACCESS_SFR * spsr_addr;
    volatile uint8_t    uc_tmp;

    /* Get address of status register for QSPI. */
    spsr_addr   = r_qspi_smstr_spsr_addr(channel);
    
    /* ---- Get QSPI information. ---- */
    trx_cnt     = p_qspi_smstr_info->data_cnt;

    /* Get address of transmit data. */
    if ((QSPI_SMSTR_SINGLE_SPI_WRITE == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        p_tx_data   = p_qspi_smstr_info->p_tx_data;
    }
    
    /* Get address of receive data. */
    if ((QSPI_SMSTR_SINGLE_SPI_READ == p_qspi_smstr_info->op_mode) ||
        (QSPI_SMSTR_SINGLE_SPI_WRITEREAD == p_qspi_smstr_info->op_mode))
    {
        p_rx_data   = p_qspi_smstr_info->p_rx_data;
    }

