renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_qspi_smstr_rx/src/r_qspi_smstr.c
    /* Clear flags of transmit buffer empty, receive buffer full and QSSL negation. */
    /* Enable QSPI transmission and reception in Single-SPI. */
    r_qspi_smstr_trx_enable_single(channel, trx_cnt);
    
    /* ==== Start QSPI transmission and reception. ==== */
    /* Transmit of the data more than half of the transmit buffer size. */
    if (QSPI_FIFO_HALF_SIZE <= trx_cnt)
    {
        /* ---- Transfer data or dummy data from RAM to QSPI Data Register. ---- */
        switch (p_qspi_smstr_info->op_mode)
        {
            case QSPI_SMSTR_SINGLE_SPI_WRITE:
            case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                /* Exchange data by endian. */
                r_qspi_smstr_tx_exchg(channel, p_tx_data, &tx_data[0]);

                /* ---- Write transmit data in long. ---- */
                r_qspi_smstr_tx_software_trans(channel, &tx_data[0]);

                /* ---- Update address of transmit data. ---- */
                p_tx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;
            break;
            case QSPI_SMSTR_SINGLE_SPI_READ:
                r_qspi_smstr_tx_software_trans_dummy(channel);
            break;
            default:
                /* Do nothing. */
            break;
        }

        /* ---- Update count of transmit data. ---- */
        trx_cnt     -= QSPI_FIFO_HALF_SIZE;

        /* Clear flag of transmit buffer empty. */
        r_qspi_smstr_sptef_clear(channel);

        if (QSPI_FIFO_HALF_SIZE <= trx_cnt)
        {
            do
            {
                /* ---- Check transmit buffer empty. ---- */
                trx_wait = QSPI_SMSTR_TX_WAIT;
                ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPTEF);
                if (QSPI_SMSTR_ERR_HARD == ret)
                {
                    /* ---- Disable QSPI transmission and reception. ---- */
                    r_qspi_smstr_trx_disable(channel);
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                    return ret;
                }

                /* ---- Transfer data or dummy data from RAM to QSPI Data Register. ---- */
                switch (p_qspi_smstr_info->op_mode)
                {
                    case QSPI_SMSTR_SINGLE_SPI_WRITE:
                    case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                        /* Exchange data by endian. */
                        r_qspi_smstr_tx_exchg(channel, p_tx_data, &tx_data[0]);

                        /* ---- Write transmit data in long. ---- */
                        r_qspi_smstr_tx_software_trans(channel, &tx_data[0]);

                        /* ---- Update address of transmit data. ---- */
                        p_tx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;
                    break;
                    case QSPI_SMSTR_SINGLE_SPI_READ:
                        r_qspi_smstr_tx_software_trans_dummy(channel);
                    break;
                    default:
                        /* Do nothing. */
                    break;
                }

                /* ---- Update count of transmit data. ---- */
                trx_cnt     -= QSPI_FIFO_HALF_SIZE;

                /* Clear flag of transmit buffer empty. */
                r_qspi_smstr_sptef_clear(channel);
                
                /* ---- Check receive buffer full. ---- */
                trx_wait = QSPI_SMSTR_RX_WAIT;
                ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPRFF);
                if (QSPI_SMSTR_ERR_HARD == ret)
                {
                    /* ---- Disable QSPI transmission and reception. ---- */
                    r_qspi_smstr_trx_disable(channel);
                    R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
                    return ret;
                }

                /* ---- Transfer data or dummy data from QSPI Data Register to RAM. ---- */
                switch (p_qspi_smstr_info->op_mode)
                {
                    case QSPI_SMSTR_SINGLE_SPI_READ:
                    case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                        /* ---- Read receive data in long. ---- */
                        r_qspi_smstr_rx_software_trans(channel, &rx_data[0]);

                        /* Exchange data by endian. */
                        r_qspi_smstr_rx_exchg(channel, p_rx_data, &rx_data[0]);

                        /* ---- Update address of receive data. ---- */
                        p_rx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;
                    break;
                    case QSPI_SMSTR_SINGLE_SPI_WRITE:
                        r_qspi_smstr_rx_software_trans_dummy(channel);
                    break;
                    default:
                        /* Do nothing. */
                    break;
                }

                /* Clear flag of receive buffer full. */
                r_qspi_smstr_sprff_clear(channel);
            }
            while (QSPI_FIFO_HALF_SIZE <= trx_cnt);
        }
        
        /* ---- Check receive buffer full. ---- */
        trx_wait = QSPI_SMSTR_RX_WAIT;
        ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPRFF);
        if (QSPI_SMSTR_ERR_HARD == ret)
        {
            /* ---- Disable QSPI transmission and reception. ---- */
            r_qspi_smstr_trx_disable(channel);
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }

        /* ---- Transfer dummy data from QSPI Data Register to RAM. ---- */
        switch (p_qspi_smstr_info->op_mode)
        {
            case QSPI_SMSTR_SINGLE_SPI_READ:
            case QSPI_SMSTR_SINGLE_SPI_WRITEREAD:
                /* ---- Read receive data in long. ---- */
                r_qspi_smstr_rx_software_trans(channel, &rx_data[0]);

                /* Exchange data by endian. */
                r_qspi_smstr_rx_exchg(channel, p_rx_data, &rx_data[0]);

                /* ---- Update address of receive data. ---- */
                p_rx_data   += (uint8_t)QSPI_FIFO_HALF_SIZE;
            break;
            case QSPI_SMSTR_SINGLE_SPI_WRITE:
                r_qspi_smstr_rx_software_trans_dummy(channel);
            break;
            default:
                /* Do nothing. */
            break;
        }

        /* Clear flag of receive buffer full. */
        r_qspi_smstr_sprff_clear(channel);
    }
    
    if (0 != trx_cnt)
    {
        /* ---- Check transmit buffer empty. ---- */
        trx_wait = QSPI_SMSTR_TX_WAIT;
        ret     = r_qspi_smstr_wait(spsr_addr, trx_wait, QSPI_SMSTR_MASK_SPTEF);
        if (QSPI_SMSTR_ERR_HARD == ret)
        {
            /* ---- Disable QSPI transmission and reception. ---- */
            r_qspi_smstr_trx_disable(channel);
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
            return ret;
        }

