renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_qspi_smstr_rx/src/r_qspi_smstr.c
/*******************************************************************************
* Function Name: r_qspi_smstr_rx_exchg
* Description  : Exchanges receive data according to endian.
* Arguments    : channel -
*                    Which channel to use
*                * p_rx_data -
*                    Pointer to recive data
*              : * p_dataadr -
*                    Pointer to exchanged data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_exchg(uint8_t channel, uint8_t * p_data, uint32_t * p_dataadr)
{
#if (QSPI_SMSTR_LITTLE_ENDIAN)
    *(uint32_t *)p_data                      = R_BSP_REVL(*p_dataadr++);
    *(uint32_t *)(p_data+QSPI_SMSTR_TRAN_SIZE)     = R_BSP_REVL(*p_dataadr++);
    *(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*2)) = R_BSP_REVL(*p_dataadr++);
    *(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*3)) = R_BSP_REVL(*p_dataadr);
#else
    *(uint32_t *)p_data                      = *p_dataadr++;
    *(uint32_t *)(p_data+QSPI_SMSTR_TRAN_SIZE)     = *p_dataadr++;
    *(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*2)) = *p_dataadr++;
    *(uint32_t *)(p_data+(QSPI_SMSTR_TRAN_SIZE*3)) = *p_dataadr;
#endif
}


/*******************************************************************************
* Function Name: r_qspi_smstr_exchg_dmacdtc
* Description  : Exchanges data according to endian using DMAC or DTC.
* Arguments    : channel -
*                    Which channel to use
*                * p_data -
*                    Pointer of data
*                size -
*                    Size of data
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_exchg_dmacdtc(uint8_t channel, uint8_t * p_data, uint32_t size)
{
#if (QSPI_SMSTR_LITTLE_ENDIAN)
    uint32_t                * p_dataadr;

    p_dataadr   = (uint32_t *)p_data;
    size        = size - (size % 4);
    do
    {
        *p_dataadr = R_BSP_REVL(*p_dataadr);
        p_dataadr  += (QSPI_SMSTR_TRAN_SIZE/sizeof(uint32_t));
        size       -= QSPI_SMSTR_TRAN_SIZE;
    }
    while(0 != size);
#endif

    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_wait
* Description  : Waits for flag to be set.
*                If time out occurred, returns error.
* Arguments    : * flag -
*                    Register to check
*                wait -
*                    Waiting time
*                mask -
*                    Mask data to specify flag to be set
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Time out has be detected.
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_wait(volatile uint8_t R_BSP_EVENACCESS_SFR * flag, uint32_t wait, uint8_t mask)
{
    /* Wait for flag to be set to 1. */
    while (QSPI_SMSTR_FLAG_CLR == ((*flag) & mask))
    {
        /* ---- Check of time out. ---- */
        wait--;
        if (0 == wait)
        {
            return QSPI_SMSTR_ERR_HARD;
        }
        
        r_qspi_smstr_wait_lp(QSPI_SMSTR_T_QSPI_WAIT);
    }
    
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_wait_lp
* Description  : Loop timer processing
* Arguments    : time -
*                    timer value
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_wait_lp(volatile uint32_t time)
{
    do
    {
        --time;
    }
    while (0 != time);
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_software_trans
* Description  : Transfers data of 16 bytes from RAM to QSPI Data Register using software.
* Arguments    : channel -
*                    Which channel to use
*              : * p_dataadr -
*                    Pointer to transmit data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_tx_software_trans(uint8_t channel, uint32_t * p_dataadr)
{
    /* Transmit data in long word. */
    r_qspi_smstr_data_set_long(channel, *p_dataadr++);
    r_qspi_smstr_data_set_long(channel, *p_dataadr++);
    r_qspi_smstr_data_set_long(channel, *p_dataadr++);
    r_qspi_smstr_data_set_long(channel, *p_dataadr++);
}


/*******************************************************************************
* Function Name: r_qspi_smstr_rx_software_trans
* Description  : Receives data of 16 bytes from QSPI Data Register and stores to RAM using software.
* Arguments    : channel -
*                    Which channel to use
*              : * p_dataadr -
*                    Pointer to buffer to store data
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_software_trans(uint8_t channel, uint32_t * p_dataadr)
{
    /* Read receive data in long word. */
    *p_dataadr++ = r_qspi_smstr_data_get_long(channel);
    *p_dataadr++ = r_qspi_smstr_data_get_long(channel);
    *p_dataadr++ = r_qspi_smstr_data_get_long(channel);
    *p_dataadr++ = r_qspi_smstr_data_get_long(channel);
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_software_trans_dummy
* Description  : Transfers dummy data of 16 bytes from RAM to QSPI Data Register using software.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_tx_software_trans_dummy(uint8_t channel)
{
    /* Write dummy data of 16 bytes in order to receive data in long word. */
    r_qspi_smstr_data_set_long(channel, QSPI_SMSTR_DUMMY_DATA_LONG);
    r_qspi_smstr_data_set_long(channel, QSPI_SMSTR_DUMMY_DATA_LONG);
    r_qspi_smstr_data_set_long(channel, QSPI_SMSTR_DUMMY_DATA_LONG);
    r_qspi_smstr_data_set_long(channel, QSPI_SMSTR_DUMMY_DATA_LONG);
}


