renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/rx_driver_package/v120/r_qspi_smstr_rx/src/r_qspi_smstr.c
/*******************************************************************************
* Function Name: r_qspi_smstr_rx_software_trans_dummy
* Description  : Transfers dummy data of 16 bytes from QSPI Data Register using software.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_software_trans_dummy(uint8_t channel)
{
    volatile uint32_t   ul_tmp;

    /* Read data of 16 bytes in long word only. Do not store the data to RAM. */
    ul_tmp = r_qspi_smstr_data_get_long(channel);
    ul_tmp = r_qspi_smstr_data_get_long(channel);
    ul_tmp = r_qspi_smstr_data_get_long(channel);
    ul_tmp = r_qspi_smstr_data_get_long(channel);
}


/*******************************************************************************
* Function Name: R_QSPI_SMstr_Get_BuffRegAddress
* Description  : Gets address of QSPI data register (SPDR).
*              : Use the address of QSPI data register to set the transfer source
*              : register or transfer destination register in DMAC or DTC.
* Arguments    : channel -
*                    Which channel to use
*                p_spdr_adr -
*                    Address of QSPI data register (SPDR)
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_PARAM -
*                    Parameter error
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Get_BuffRegAddress(uint8_t channel, uint32_t *p_spdr_adr)
{
    qspi_smstr_status_t ret = QSPI_SMSTR_SUCCESS;
    
    /* ---- Check argument. ---- */
    ret = r_qspi_smstr_ch_check(channel);
    if (QSPI_SMSTR_SUCCESS != ret)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    if (0 == p_spdr_adr)
    {
        R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR, __LINE__);
        return QSPI_SMSTR_ERR_PARAM;
    }

    r_qspi_smstr_get_buffregaddress(channel, p_spdr_adr);

    return QSPI_SMSTR_SUCCESS;
}


/*****************************************************************************
* Function Name: R_QSPI_SMstr_GetVersion
* Description  : Returns the version of QSPI single master driver.
*                The version number is encoded such that the top two bytes are
*                the major version number and the bottom two bytes are the minor
*                version number.
* Arguments    : none
* Return Value : version number
******************************************************************************/
uint32_t R_QSPI_SMstr_GetVersion(void)
{
    uint32_t const version = (QSPI_SMSTR_VERSION_MAJOR << 16) | QSPI_SMSTR_VERSION_MINOR;
    
    return version;
}


#ifdef QSPI_SMSTR_CFG_LONGQ_ENABLE
/*******************************************************************************
* Function Name: R_QSPI_SMstr_Set_LogHdlAddress
* Description  : Sets handler Address.
* Arguments    : user_long_que -
*                    Handler Address
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Set_LogHdlAddress(uint32_t user_long_que)
{
    p_qspi_smstr_long_que = (longq_hdl_t)user_long_que;
    return QSPI_SMSTR_SUCCESS;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_log
* Description  : Stores error information to LONGQ buffer.
* Arguments    : flg -
*                    Breakpoint processing
*                fid -
*                    QSPI driver file No.
*                line -
*                    QSPI driver line number
* Return Value : 0 -
*                    Successful operation
*                1 -
*                    Error
*******************************************************************************/
uint32_t r_qspi_smstr_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err;
    uint32_t    ul_tmp;

    /* Long to Byte */
    ul_tmp = 0;                                         /* smstr_log   Reserved               */
    ul_tmp = (ul_tmp | (line << 8));                    /* smstr_log   LINE                   */
    ul_tmp = (ul_tmp | (fid  << 21));                   /* smstr_log   FID FILE No.           */
    ul_tmp = (ul_tmp | (QSPI_SMSTR_DRIVER_ID << 27));     /* smstr_log   FID DRIVER No.         */
    ul_tmp = (ul_tmp | (flg  << 31));                   /* smstr_log   Breakpoint processing  */

    err = R_LONGQ_Put(p_qspi_smstr_long_que, ul_tmp);
    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }
    return 0;
}
#else
/*******************************************************************************
* Function Name: R_QSPI_SMstr_Set_LogHdlAddress
* Description  : Sets handler Address.
* Arguments    : user_long_que -
*                    Handler Address
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*******************************************************************************/
qspi_smstr_status_t R_QSPI_SMstr_Set_LogHdlAddress(uint32_t user_long_que)
{
    return QSPI_SMSTR_SUCCESS;
}
#endif  /* QSPI_SMSTR_CFG_LONGQ_ENABLE */


/*******************************************************************************
* Function Name: R_QSPI_SMstr_Log
* Description  : Stores error information to LONGQ buffer.
* Arguments    : flg -
*                    Breakpoint processing
*                fid -
*                    QSPI driver file No.
*                line -
*                    QSPI driver line number
* Return Value : 0 -
*                    Successful operation
*                1 -
*                    Error
*******************************************************************************/
uint32_t R_QSPI_SMstr_Log(uint32_t flg, uint32_t fid, uint32_t line)
{
    R_QSPI_SMSTR_LOG_FUNC(flg, fid, line);
    return 0;
}


/* End of File */

